Revit 2024 API
BuiltInFailures.SketchFailures.TrussOverlappingReference Property
 Truss references (chains of one or more reference lines) cannot overlap themselves in the vertical direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussOverlappingReference { get; }
Visual Basic
Public Shared ReadOnly Property TrussOverlappingReference As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussOverlappingReference {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace